planes-de-prueba/aggregate2.csv
Label,# Samples,Average,Median,90% Line,95% Line,99% Line,Min,Max,Error %,Throughput,Received KB/sec,Sent KB/sec
1. User Login,200,113,110,132,146,173,82,205,"0,000%",",04020","0,06","0,01"
JSR223 Sampler - Feliz,150,3,3,5,7,24,1,25,"0,000%",",03030","0,00","0,00"
2. Get User Profile,200,41,43,61,64,71,11,74,"0,000%",",04020","0,05","0,02"
3. Browse Products,200,67,72,105,109,112,11,118,"0,000%",",04020","0,50","0,01"
4. Get Product Details,200,37,37,57,61,62,11,64,"0,000%",",04020","0,06","0,01"
Create Cart,200,40,39,61,63,66,12,68,"0,000%",",04020","0,05","0,02"
Add Item,200,112,112,152,156,161,63,162,"0,000%",",04020","0,05","0,03"
Get Items,200,37,39,56,59,62,9,63,"0,000%",",04020","0,06","0,02"
Update Item,200,75,76,103,107,111,34,112,"0,000%",",04020","0,05","0,03"
Delete Item,200,34,35,53,57,59,7,65,"0,000%",",04020","0,04","0,02"
Create Order,200,310,312,395,407,413,215,417,"0,000%",",04020","0,06","0,03"
Get Order Status,200,35,35,55,59,63,11,66,"0,000%",",04020","0,05","0,02"
Create Payment,200,761,756,965,990,1008,515,1012,"5,500%",",04020","0,05","0,03"
Get Payment,189,31,33,55,57,60,4,62,"14,286%",",03799","0,05","0,02"
JSR223 Sampler - Fallo,50,3,3,4,5,18,1,18,"0,000%",",01020","0,00","0,00"
TOTAL,2789,121,52,329,655,947,1,1012,"1,362%",",55971","1,13","0,28"