planes-de-prueba/summary2.csv
Label,# Samples,Average,Min,Max,Std. Dev.,Error %,Throughput,Received KB/sec,Sent KB/sec,Avg. Bytes
1. User Login,200,113,82,205,"17,70","0,000%",",04020","0,06","0,01","1401,5"
JSR223 Sampler - Feliz,150,3,1,25,"3,20","0,000%",",03030","0,00","0,00",",0"
2. Get User Profile,200,41,11,74,"15,80","0,000%",",04020","0,05","0,02","1332,5"
3. Browse Products,200,67,11,118,"29,36","0,000%",",04020","0,50","0,01","12705,0"
4. Get Product Details,200,37,11,64,"13,98","0,000%",",04020","0,06","0,01","1642,0"
Create Cart,200,40,12,68,"14,79","0,000%",",04020","0,05","0,02","1289,0"
Add Item,200,112,63,162,"29,29","0,000%",",04020","0,05","0,03","1300,0"
Get Items,200,37,9,63,"14,67","0,000%",",04020","0,06","0,02","1497,0"
Update Item,200,75,34,112,"21,46","0,000%",",04020","0,05","0,03","1295,0"
Delete Item,200,34,7,65,"13,90","0,000%",",04020","0,04","0,02","989,0"
Create Order,200,310,215,417,"61,11","0,000%",",04020","0,06","0,03","1473,0"
Get Order Status,200,35,11,66,"14,86","0,000%",",04020","0,05","0,02","1215,0"
Create Payment,200,761,515,1012,"145,24","5,500%",",04020","0,05","0,03","1321,8"
Get Payment,189,31,4,62,"17,20","14,286%",",03799","0,05","0,02","1372,3"
JSR223 Sampler - Fallo,50,3,1,18,"2,45","0,000%",",01020","0,00","0,00",",0"
TOTAL,2789,121,1,1012,"197,41","1,362%",",55971","1,13","0,28","2062,2"